/*
*********************************************************************************************************
*
*	模块名称 : 主程序模块。
*	文件名称 : main.c(任务的优先级数值越小优先级越低，这个跟uCOS相反)

*********************************************************************************************************
*/

#include "bsp.h"			/* 底层硬件驱动 */
/*
**********************************************************************************************************
											函数声明
**********************************************************************************************************
*/
/*任务1：看门狗
*任务2：处理串口3的lora数据（通过事件标志组），和服务器进行命令交互
*
*
*
*/

static void AppTaskCreate (void);//创建除start任务外的其他任务
static void AppObjCreate (void);//用来初始化邮箱和软件定时器

    
//任务函数
__task void AppTaskStart(void);

/*
**********************************************************************************************************
											 变量
**********************************************************************************************************
*/
static uint64_t AppTaskStartStk[512/8];   /* 任务栈 */

/* 任务句柄 */
OS_TID HandleTaskStart = NULL;


/*
*********************************************************************************************************
*	函 数 名: main
*	功能说明: 标准c程序入口。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int main(void) 
{	
	/* 初始化外设 */
	bsp_Init();
    
	/* 创建启动任务 */
 	os_sys_init_user(AppTaskStart,             /* 任务函数 */
	                  8,                        /* 任务优先级 */
	                  &AppTaskStartStk,         /* 任务栈 */
	                  sizeof(AppTaskStartStk)); /* 任务栈大小，单位字节数 */
	while(1);
}



/*
*********************************************************************************************************
*	函 数 名: AppTaskStart
*	主要功能: 进行心跳包和喂狗，读DS1302时间，网络状态
*********************************************************************************************************
*/

__task void AppTaskStart(void)
{
    //test
    uint16_t battery;
    
    /* 获取启动任务的句柄 */
	HandleTaskStart = os_tsk_self();
    //通过start任务间接地创建其他任务
	AppTaskCreate();
    /* 创建任务通信机制 */
	AppObjCreate();
    
	
    while(1)
    {
        IWDG_Feed();//喂狗
        //test
        GetADC(&battery);
        battery = (battery*3300/4095);
        //SendDataToServer(0x01, 0, g_tGps.time, sizeof(g_tGps.time));
        //os_dly_wait(15000);
        os_dly_wait(3000);
    }
}

/*
*********************************************************************************************************
*	函 数 名: AppTaskCreate
*	功能说明: 创建应用任务
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void AppTaskCreate (void)
{
    
}

/*
*********************************************************************************************************
*	函 数 名: AppObjCreate
*	功能说明: 创建任务通信机制
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void AppObjCreate (void)
{
	/* 创建消息邮箱 */

}


/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
